app/controllers/api/v1/teams_controller.rb

SELECT "teams".* FROM "teams" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "teams"
---
      def index
        authorize Team
        @pagination, @teams = paginate(policy_scope(Team.all))

INSERT INTO "teams" ("name", "created_at", "updated_at", "captain_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test Team 1"], ["created_at", "2022-02-10 19:19:04.171597"], ["updated_at", "2022-02-10 19:19:04.171597"], ["captain_id", 3]]
---
      def create
        authorize Team
        ActiveRecord::Base.transaction do
          @team = Team.new(team_create_params)
          @team.captain = @user
          @team.save!

UPDATE "teams" SET "name" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["name", "updated name"], ["updated_at", "2022-02-10 19:21:04.883510"], ["id", 1]]
---
      def update
        authorize @team
        @team.update!(team_update_params)

SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def set_team
        @team = Team.find(params[:id])