app/controllers/api/v1/user_requests_controller.rb

INSERT INTO "join_requests" ("player_id", "team_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["player_id", 9], ["team_id", 3], ["message", "I want to join"], ["created_at", "2022-02-11 21:02:27.100815"], ["updated_at", "2022-02-11 21:02:27.100815"]]
---
      def create
        authorize_with_policy JoinRequest
        @request = current_user.requests.create!(request_params)