app/models/join_request.rb

  def unique_request
    if self.player.requests.find_by_team_id(self.team_id) != nil
---
SELECT "join_requests".* FROM "join_requests" WHERE "join_requests"."player_id" = $1 AND "join_requests"."team_id" = $2 LIMIT $3  [["player_id", 9], ["team_id", 3], ["LIMIT", 1]]