app/models/user.rb

  def leave_team!
    if self.team == nil
      errors.add(:team, "you don't have a team")
      raise ActiveRecord::RecordInvalid.new(self)
      return
    end
    if self.team.captain_id == self.id
      if self.team.players.count > 1
        self.errors.add(:captain, "You must set a captain for the team before leaving")
        raise ActiveRecord::RecordInvalid.new(self)
        return
      else
        self.team.destroy!
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "users" WHERE "users"."team_id" = $1  [["team_id", 2]]
DELETE FROM "teams" WHERE "teams"."id" = $1  [["id", 2]]